# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

s, p = map(int, input('Введите сумму чисел S и произведение P, через пробел: ').split(' '))
flag = True
for i in range(s):
    if flag == True:
        for j in range(s):
            if i + j == s and i * j == p:
                print(f'Первое число {i}, второе число {j}')
                flag = False